export default {
  layout: {
    nav: {
      about: "обо мне",
      skills: "навыки",
      career: "карьера",
      education: "образование",
      projects: "проекты",
    },
    footer: {
      copyright: "Cделал Аксенченко Стефан",
    },
  },
  home: {
    meta: {
      title: "Резюме | Аксенченко Стефан",
      description:
        "Я сеньор фронтенд-разработчик и страстный фанат технологий, Исследуйте мой сайт, чтобы узнать больше обо мне и моей экспертизе в создании отзывчивых и удобных веб-решений.",
    },
    hero: {
      position: "фронтенд разработчик",
      name: "Аксенченко Стефан",
      download: "скачать резюме",
    },
    about: {
      title: "Обо мне",
      welcome: "Привет, я Стефан!",
      info: "Я сеньёр фронтенд-разработчик, страстно обожаю технологии. Каждый день я стараюсь узнать что-то новое, самосовершенствование - моё кредо. Считаю, что командная работа - ключ к успеху, и всегда стараюсь создать позитивную, дружную атмосферу, лишенную токсичности. В настоящее время проживаю в Казахстане и с нетерпением ожидаю возможности применить свои знания и опыт для создания инновационных программных продуктов.",
      male: "мужской",
      age: "27 лет",
      location: "Казахстан, Алматы",
    },
    skills: {
      title: "Технические навыки",
    },
    career: {
      title: "Карьера",
      "Mygento eCommerce Solutions": "Mygento eCommerce Solutions",
      "front-end developer": "фронтенд разработчик",
      "As Front-end developer at Mygento eCommerce Solutions":
        "В роли фронтенд-разработчика в Mygento eCommerce Solutions я играл важную роль в поддержке и улучшении программных продуктов. Мои обязанности включали в себя:",
      "Support and Development: I was responsible for actively participating in":
        "Поддержка и разработка: Активно участвовал в разработке новых функций и возможностей для наших программных продуктов. Это включало в себя написание кода, тестирование и внедрение новых решений для удовлетворения требований проекта.",
      "Code Refactoring and Optimization: I consistently worked on improving the quality":
        "Рефакторинг и оптимизация кода: Я постоянно работал над улучшением качества кодовой базы, проводя рефакторинг и оптимизацию кода. Этот процесс не только улучшил производительность программного обеспечения, но также сделал его более легко поддерживаемым.",
      "Mentoring and Training: I took on the role of mentoring junior developers":
        "Наставничество и обучение: Я взял на себя роль наставника для нескольких младших разработчиков, делясь лучшими практиками в разработке программного обеспечения. Это помогло команде расти и улучшать свои навыки, способствуя общему успеху проекта.",
      "Client Communication: I established and maintained effective communication with clients":
        "Общение с клиентами: Я поддерживал продуктивное общение с клиентами, чтобы понимать их потребности и требования. Активное взаимодействие с клиентами позволило грамотно проектировать решиния и выполнять поставленные задачи в срок.",
      Nevafilm: "Невафильм",
      "back-end developer": "бэкенд разработчик",
      "During my tenure at Nevafilm, I took on the role of developing a system designed to streamline the generation of documentation and contracts.":
        "Во время моей работы в Nevafilm я разрабатывал систему, предназначенную для автоматизации процесса генерации документов и контрактов. Мои основные обязанности включали в себя:",
      "I led the design and development of a robust and user-friendly system for generating documentation and contracts.":
        "Проектирование и разработка надежной и удобной для пользователей системы для генерации документации и контрактов. Это включало в себя создание пользовательского интерфейса, интеграцию с базой данных и внедрение необходимой логики для автоматизации процесса генерации документов.",
      "User-Friendly Interfaces: I ensured that the system's user interfaces were intuitive and easy to navigate":
        "Разработка удобного для пользователя интерфейса, чтобы он был интуитивно понятными и легкими в навигации, что делало их доступными для сотрудников с разным уровнем технической компетенции.",
      "Documentation Customization: I implemented features that allowed for customization of generated documents":
        "Кастомизация, я внедрил функции, позволяющие настраивать сгенерированные документы, приспосабливая их под конкретные потребности клиента или требования проекта.",
    },
    education: {
      title: "образование",
      degree: "степень",
      department: "факультет",
      "Saint Petersburg State Chemical and Pharmaceutical University":
        "Санкт-Петербургский государственный химико-фармацевтический университет",
      bachelor: "бакалавр",
      "chemical technology": "химическая технология",
      master: "магистр",
      "economics and management of the Pharmaceutical industry":
        "экономика и управление фармацевтическим предприятием",
    },
    projects: {
      title: "Проекты",
      nda: "Я участвовал в проектах, которые находятся под защитой NDA (Соглашения о неразглашении).",
    },
  },
} as const;
